#define B0 32258
#define C1 30303
#define CS1 28571
#define D1 27027
#define DS1 25641
#define E1 24390
#define F1 22727
#define FS1 21739
#define G1 20408
#define GS1 19230
//#define A1 18181
#define AS1 17241
#define B1 16129
#define C2 15384
#define CS2 14492
#define D2 13698
#define DS2 12820
#define E2 12195
#define F2 11494
#define FS2 10752
#define G2 10204
#define GS2 9615
//#define A2 9090
#define AS2 8547
#define B2 8130
#define C3 7633
#define CS3 7194
#define D3 6802
#define DS3 6410
#define E3 6060
#define F3 5714
#define FS3 5405
#define G3 5102
#define GS3 4807
//#define A3 4545
#define AS3 4291
#define B3 4048
#define C4 3816
#define CS4 3610
#define D4 3401
#define DS4 3215
#define E4 3030
#define F4 2865
#define FS4 2702
#define G4 2551
#define GS4 2409
#define A4 2272
#define AS4 2145
#define B4 2024
#define C5 1912
#define CS5 1805
#define D5 1703
#define DS5 1607
#define E5 1517
#define F5 1432
#define FS5 1351
#define G5 1275
#define GS5 1203
#define A5 1136
#define AS5 1072
#define B5 1012
#define C6 955
#define CS6 901
#define D6 851
#define DS6 803
#define E6 758
#define F6 715
#define FS6 675
#define G6 637
#define GS6 602
#define A6 568
#define AS6 536
#define B6 506
#define C7 477
#define CS7 451
#define D7 425
#define DS7 401
#define E7 379
#define F7 357
#define FS7 337
#define G7 318
#define GS7 301
#define A7 284
#define AS7 268
#define B7 253
#define C8 238
#define CS8 225
#define D8 212
#define DS8 200

#define PWM_PIN0 0
#define PWM_PIN1 1
#define PWM_PIN2 2
#define PWM_PIN3 4

void muse(int scale, float num, int pinnum)
{
   int buzz;
   int cycle = 100;
   buzz=pwm_open(pinnum);
   pwm_write(buzz, scale, cycle);
   usleep(1332000/num);
   pwm_close(buzz);
}


int mario_song[] =
   {
		   /****************
		   * PAGE1
		   ****************/

		  E6, E6, 1, E6, 1, C6, E6,
		  G6, 1, G5, 1,
		  /////도돌이표 시작

		  C6, 1, G5, 1, E5,
		  1, A5, B5, AS5, A5,
		  G5, E6, G6, A6, F6, G6,
		  1, E6, C6, D6, B5, 1,

		  C6, 1, G5, 1, E5,
		  1, A5, B5, AS5, A5,
		  G5, E6, G6, A6, F6, G6,
		  1, E6, C6, D6, B5, 1,
		  ////dded
		  /////dd

		  1, G6, FS6, F6, DS6, E6,
		  1, GS5, A5, C6, 1, A5, C6, D6,
		  1, G6, FS6, F6, DS6, E6,

		  1, C7, C7, C7, 1,
		  1, G6, FS6, F6, DS6, E6,
		  1, GS5, A5, C6, 1, A5, C6, D6,
		  1, DS6, 1, D6, 1,
		  C6, 1, 1,

//		  1, G6, FS6, F6, DS6, E6,
//		  1, GS5, A5, C6, 1, A5, C6, D6,
//		  1, G6, FS6, F6, DS6, E6,
//
//		  1, C7, C7, C7, 1,
//		  1, G6, FS6, F6, DS6, E6,
//		  1, GS5, A5, C6, 1, A5, C6, D6,
//		  1, DS6, 1, D6, 1,
//		  C6, 1, 1,
		  //////dded

		  C6, C6, 1, C6, 1, C6, D6,
		  E6, C6, 1, A5, G5,
		  C6, C6, 1, C6, 1, C6, D6, E6,
		  1,
		  C6, C6, 1, C6, 1, C6, D6,

		  /****************
		   * PAGE2
		   ****************/

		  E6, C6, 1, A5, G5,
		  E6, E6, 1, E6, 1, C6, E6,
		  G6, 1, G5, 1,

		  ////////dd
		  C6, 1, G5, 1, E5,
		  1, A5, B5, AS5, A5,
		  G5, E6, G6, A6, F6, G6,
		  1, E6, C6, D6, B5, 1,

//		  C6, 1, G5, 1, E5,
//		  1, A5, B5, AS5, A5,
//		  G5, E6, G6, A6, F6, G6,
//		  1, E6, C6, D6, B5, 1,
		  ////////////dded
		  ////////////dd
		  E6, C6, G5, 1, GS5,
		  A5, F6, F6, A5, 1,
		  B5, A6, A6, A6, G6, F6,
		  E6, C6, A5, G5, 1,

		  E6, C6, G5, 1, GS5,
		  A5, F6, F6, A5, 1,
		  B5, F6, F6, F6, E6, D6,
		  G5, E5, E5, C5, 1,

//		  E6, C6, G5, 1, GS5,
//		  A5, F6, F6, A5, 1,
//		  B5, A6, A6, A6, G6, F6,
//		  E6, C6, A5, G5, 1,
//
//		  E6, C6, G5, 1, GS5,
//		  A5, F6, F6, A5, 1,
//		  B5, F6, F6, F6, E6, D6,
//		  G5, E5, E5, C5, 1,

		  ////////dded

		  C6, C6, 1, C6, 1, C6, D6,
		  E6, C6, 1, A5, G5,
		  C6, C6, 1, C6, 1, C6, D6, E6,
		  1, E6, G6, E7, C7, D7, G7,
		  C6, C6, 1, C6, 1, C6, D6,
		  E6, C6, 1, A5, G5,

		  /****************
		   * PAGE3
		   ****************/
		  E6, E6, 1, E6, 1, C6, E6,
		  G6, 1, G5, 1,

		  //////////dd
		  E6, C6, G5, 1, GS5,
		  A5, F6, F6, A5, 1,
		  B5, A6, A6, A6, G6, F6,

		  E6, C6, A5, G5, 1,
		  E6, C6, G5, 1, GS5,
		  A5, F6, F6, A5, 1,
		  B5, F6, F6, F6, E6, D6,
		  G5, E5, E5, C5, 1,


//		  E6, C6, G5, 1, GS5,
//		  A5, F6, F6, A5, 1,
//		  B5, A6, A6, A6, G6, F6,
//
//		  E6, C6, A5, G5, 1,
//		  E6, C6, G5, 1, GS5,
//		  A5, F6, F6, A5, 1,
//		  B5, F6, F6, F6, E6, D6,
//		  G5, E5, E5, C5, 1,

		  //////////////dded


		  C6, 1, G5, 1, E5,
		  A5, B5, A5, GS5, AS5, A5,
		  E5, D5, E5
   };

   float mario_beat[] =
   {
		  8, 8, 8, 8, 8, 8, 4,
		  4, 4, 4, 4,

		  ///////////도돌이표 시작
		  4, 8, 4, 8, 4,
		  8, 4, 4, 8, 4,
		  6, 6, 6, 4, 8, 8,
		  8, 4, 8, 8, 4, 8,

		  4, 8, 4, 8, 4,
		  8, 4, 4, 8, 4,
		  6, 6, 6, 4, 8, 8,
		  8, 4, 8, 8, 4, 8,
		  //////////////도돌이표 끝
		  //////////도돌이표 시작
		  4, 8, 8, 8, 4, 8,
		  8, 8, 8, 8, 8, 8, 8, 8,
		  4, 8, 8, 8, 4, 8,

		  8, 4, 8, 4, 4,
		  4, 8, 8, 8, 4, 8,
		  8, 8, 8, 8, 8, 8, 8, 8,
		  4, 4, 8, 4, 8,
		  4, 4, 2,

//		  4, 8, 8, 8, 4, 8,
//		  8, 8, 8, 8, 8, 8, 8, 8,
//		  4, 8, 8, 8, 4, 8,
//
//		  8, 4, 8, 4, 4,
//		  4, 8, 8, 8, 4, 8,
//		  8, 8, 8, 8, 8, 8, 8, 8,
//		  4, 4, 8, 4, 8,
//		  4, 4, 2,
		  ///////도돞이표 끝

		  8, 8, 8, 8, 8, 8, 4,
		  8, 8, 8, 8, 2,
		  8, 8, 8, 8, 8, 8, 8, 8,
		  1,
		  8, 8, 8, 8, 8, 8, 4,

		  /****************
		   * PAGE2
		   ****************/

		  8, 8, 8, 8, 2,
		  8, 8, 8, 8, 8, 8, 4,
		  4, 4, 4, 4,

		  ////////도돌이표 시작
		  4, 8, 4, 8, 4,
		  8, 4, 4, 8, 4,
		  6, 6, 6, 4, 8, 8,
		  8, 4, 8, 8, 4, 8,

//		  4, 8, 4, 8, 4,
//		  8, 4, 4, 8, 4,
//		  6, 6, 6, 4, 8, 8,
//		  8, 4, 8, 8, 4, 8,
		  ///////////도돌이표 끝
		  //////////도돌이표 시작
		  8, 4, 8, 4, 4,
		  8, 4, 8, 4, 4,
		  6, 6, 6, 6, 6, 6,
		  8, 4, 8, 4, 4,

		  8, 4, 8, 4, 4,
		  8, 4, 8, 4, 4,
		  8, 4, 8, 6, 6, 6,
		  8, 4, 8, 4, 4,

//		  8, 4, 8, 4, 4,
//		  8, 4, 8, 4, 4,
//		  6, 6, 6, 6, 6, 6,
//		  8, 4, 8, 4, 4,
//
//		  8, 4, 8, 4, 4,
//		  8, 4, 8, 4, 4,
//		  8, 4, 8, 6, 6, 6,
//		  8, 4, 8, 4, 4,
		  ////////////도돌이표 끝

		  8, 8, 8, 8, 8, 8, 4,
		  8, 8, 8, 8, 2,
		  8, 8, 8, 8, 8, 8, 8, 8,
		  4, 8, 8, 8, 8, 8, 8,
		  8, 8, 8, 8, 8, 8, 4,
		  8, 8, 8, 8, 2,

		  /****************
		   * PAGE3
		   ****************/

		  8, 8, 8, 8, 8, 8, 4,
		  4, 4, 4, 4,

		  //////도돌이표 시작
		  8, 4, 8, 4, 4,
		  8, 4, 8, 4, 4,
		  6, 6, 6, 6, 6, 6,

		  8, 4, 8, 4, 4,
		  8, 4, 8, 4, 4,
		  8, 4, 8, 4, 4,
		  8, 4, 8, 6, 6, 6,
		  8, 4, 8, 4, 4,

//		  8, 4, 8, 4, 4,
//		  8, 4, 8, 4, 4,
//		  6, 6, 6, 6, 6, 6,
//
//		  8, 4, 8, 4, 4,
//		  8, 4, 8, 4, 4,
//		  8, 4, 8, 4, 4,
//		  8, 4, 8, 6, 6, 6,
//		  8, 4, 8, 4, 4,
		  ////////도돌이표 끝

		  4, 8, 4, 8, 4,
		  6, 6, 6, 6, 6, 6,
		  8, 8, 1.33

   };
